dep_1 = require('xxx/yyy')

str_0 = 'text 1' + 'text # 2\n' +
  "TEXT 3" + "TEXT # 4\n"

str_1 = 'текст 1' + 'text № 2\n' +
  "ТЕКСТ 3" + "TEXT № 4\n" +
  "TEXT 3" + "TEXT # 4\n"

--------------------------------------------------------------------------------

str_4 = obj.foo(
  'текст 1' + 'текст № 2\n' +
  "ТЕКСТ 3" + "ТЕКСТ № 4\n" +
  "TEXT 3" + "TEXT # 4\n"
)

str_5 = obj.foo('текст 1')

str_6 = 'текст текст текст'

-- В RegExp не оборачиваем...
-- TODO: regexp = /[A-Za-z0-9А-Яа-я]/

--------------------------------------------------------------------------------
-- В комментариях не оборачиваем...

-- str_6 = 'текст 1'

--[[
str_6 = "текст 1"
]]

--[[
 -- str_6 = 'текст 1'
]]
