dep_1 = require('xxx/yyy')
tr = require('L10n').translator

str_0 = 'text 1' + 'text # 2\n' +
  "TEXT 3" + "TEXT # 4\n"

-- str_1 = 'текст 1' + ' text № 2\n' +
--   "ТЕКСТ 3 " + " TEXT № 4\n" +
--   "TEXT 3" + "TEXT # 4\n"

str_2 = tr.msg(
  'текст 1' + 'текст № 2\n' +
  "ТЕКСТ 3" + "ТЕКСТ № 4\n"
);

str_3 = tr.msg('текст 1')

--------------------------------------------------------------------------------

str_4 = obj.foo(
  tr.msg('текст 1') + tr.msg('текст № 2\n') +
  -- "ТЕКСТ 3" + "   ТЕКСТ № 4      " + " " +
  "TEXT 3" + "TEXT # 4\n"
)

str_5 = obj.foo(tr.msg('текст 1'))

str_6 = tr.msg('текст 1')

-- str_7 = '   текст 1     '

--------------------------------------------------------------------------------

obj = {
  Key_1 = tr.msg('Текст'),
  Key_2 = 'Text'
}

str_ru = tr.msg('Текст')
str_en = 'Text'

--------------------------------------------------------------------------------
-- В комментариях не оборачиваем...

-- str_6 = 'текст 1'

--[[
str_6 = "текст 1"
]]

--[[
 -- str_6 = 'текст 1'
]]
